--اطلاعات جدول لیدرها
INSERT INTO TourLeaders (FirstName, LastName, ContactInfo, ExperienceYears, Languages, Specialization) VALUES
('رضا', 'نیاکان', '09121234567 - reza@example.com', 10, 'فارسی, انگلیسی', 'فرهنگی'),
('مینا', 'صادقی', '09123456789 - mina@example.com', 8, 'فارسی, فرانسوی', 'مکان‌های طبیعی'),
('حمید', 'رضایی', '09125678901 - hamid@example.com', 12, 'فارسی, عربی', 'تورهای مذهبی'),
('سارا', 'امینی', '09127654321 - sara@example.com', 6, 'فارسی, ترکی', 'فرهنگی'),
('امیر', 'نیکو', '09129876543 - amir@example.com', 9, 'فارسی, انگلیسی', 'کوهنوردی'),
('رامین', 'دهقانی', '09121122334 - farzaneh@example.com', 6, 'فارسی, آلمانی', 'تورهای مذهبی'),
('کامران', 'زارعی', '09123334455 - kamran@example.com', 10, 'فارسی, اسپانیایی', 'بیابان‌گردی'),
('محمد', 'رضوانی', '09124445566 - negar@example.com', 9, 'فارسی, روسی', 'کوهنوردی');

--اطلاعات جدول تورها
INSERT INTO Tours (TourName, Destination, StartDate, EndDate, Price, MaxParticipants, TourLeaderID) VALUES
('تور تهران گردی', 'تهران', '2025-06-01', '2025-06-09', 3500000, 20, 1),
('تور کویر یزد', 'یزد', '2025-06-11', '2025-06-17', 2800000, 15, 2),
('تور شمال جنگلی', 'رشت', '2025-06-21', '2025-06-26', 3200000, 25, 1),
('تور تهران گردی', 'تهران', '2025-07-01', '2025-07-06', 2000000, 30, 4),
('تور کوهنوردی دماوند', 'دماوند', '2025-07-11', '2025-07-18', 4500000, 10, 8),
('تور کویر یزد', 'یزد', '2025-07-21', '2025-07-31', 4000000, 18, 6),
('تور بیابان لوت', 'کرمان', '2025-07-31', '2025-08-05', 3700000, 12, 1),
('تور تبریز شهری', 'تبریز', '2025-08-10', '2025-08-14', 3000000, 22, 8);

--اطلاعات تورها
INSERT INTO Accommodations (HotelName, Location, TourID, PricePerNight, Rating) VALUES
('هتل پارس', 'شیراز', 1, 500000, 4.5),
('هتل صفائیه', 'یزد', 2, 400000, 4.2),
('هتل کادوس', 'رشت', 3, 450000, 4.0),
('هتل اسپیناس', 'تهران', 4, 550000, 4.6),
('هتل آوین', 'دماوند', 5, 600000, 4.4),
('هتل آزادی', 'خرم‌آباد', 6, 420000, 4.1),
('هتل جهانگردی', 'کرمان', 7, 470000, 4.3),
('هتل شهریار', 'تهران', 8, 530000, 4.7);

--اطلاعات مسافران
INSERT INTO Travelers (FirstName, LastName, Email, PhoneNumber, PassportNumber) VALUES
('علی', 'محمدی', 'ali1@example.com', '09121110001', 'P123001'),
('زهرا', 'احمدی', 'zahra2@example.com', '09121110002', 'P123002'),
('سینا', 'مهدوی', 'sina3@example.com', '09121110003', 'P123003'),
('نگین', 'رحیمی', 'negin4@example.com', '09121110004', 'P123004'),
('رضا', 'عباسی', 'reza5@example.com', '09121110005', 'P123005'),
('امیر', 'شریفی', 'maryam6@example.com', '09121110006', 'P123006'),
('پرهام', 'رحمانی', 'parham7@example.com', '09121110007', 'P123007'),
('نازنین', 'مرادی', 'nazanin8@example.com', '09121110008', 'P123008');

--اطلاعات رزروها
INSERT INTO Reservations (TourID, ReservationDate, Status) VALUES
(1, '2025-05-01', 'Confirmed'),
(2, '2025-05-02', 'Confirmed'),
(8, '2025-05-03', 'Pending'),
(4, '2025-05-04', 'Confirmed'),
(1, '2025-05-05', 'Pending'),
(6, '2025-05-06', 'Confirmed'),
(1, '2025-05-07', 'Cancelled'),
(8, '2025-05-08', 'Confirmed'),
(1, '2025-05-05', 'Pending'),
(2, '2025-05-06', 'Confirmed'),
(6, '2025-05-07', 'Cancelled'),
(8, '2025-05-08', 'pending');

--اطلاعات جدول میانی
INSERT INTO TravelerReservations (TravelerID, ReservationID) VALUES
(1, 5), (2, 2), (3, 1), (4, 3),
(5, 2), (3, 8), (7, 7), (2, 7);

-- اطلاعات پرداخت
INSERT INTO Payments (ReservationID, PaymentDate, Amount, PaymentMethod, PaymentStatus) VALUES
(1, '2025-05-01', 3500000, 'کارت بانکی', 'Completed'),
(2, '2025-05-01', 2800000, 'کارت بانکی', 'Completed'),
(3, '2025-05-03', 3200000, 'پرداخت نقدی', 'Pending'),
(4, '2025-05-04', 2000000, 'کارت بانکی', 'Completed'),
(5, '2025-05-05', 4500000, 'کارت بانکی', 'Pending'),
(6, '2025-05-03', 4000000, 'کارت بانکی', 'Completed'),
(7, '2025-05-07', 3700000, 'کارت بانکی', 'Refunded'),
(8, '2025-05-03', 3000000, 'کارت بانکی', 'Completed');
